{
  "common": {
    "name": "influxdb",
    "desc": {
      "en": "Logging of states into InfluxDB",
      "de": "Loggt die Historie von einzelnen Zuständen in einer InfluxDB",
      "ru": "Сохраняет историю событий для отдельных состояний в InfluxDB",
      "pt": "Registro de estados no InfluxDB",
      "nl": "Loggen van staten in InfluxDB",
      "fr": "Journalisation des états dans InfluxDB",
      "it": "Registrazione degli stati in InfluxDB",
      "es": "Registro de estados en InfluxDB",
      "pl": "Logowanie stanów do InfluxDB",
      "zh-cn": "将状态记录到InfluxDB中"
    },
    "version": "3.2.0",
    "title": "Logging data with InfluxDB",
    "titleLang": {
      "en": "Logging data with InfluxDB",
      "de": "Daten mit InfluxDB protokollieren",
      "ru": "Запись данных с помощью InfluxDB",
      "pt": "Registro de dados com InfluxDB",
      "nl": "Loggen van gegevens met InfluxDB",
      "fr": "Consignation des données avec InfluxDB",
      "it": "Registrazione dei dati con InfluxDB",
      "es": "Datos de registro con InfluxDB",
      "pl": "Rejestrowanie danych za pomocą InfluxDB",
      "zh-cn": "使用InfluxDB记录数据"
    },
    "news": {
      "3.2.0": {
        "en": "Adjust cache file to be different per instance when having multiple instances",
        "de": "Bestimmen Sie die Cache-Datei, um unterschiedlich zu sein pro Instanz, wenn mehrere Instanzen haben",
        "ru": "Отрегулируйте файл кэша для того чтобы быть различным в случае если иметь несколько экземпляров",
        "pt": "Ajuste o arquivo de cache para ser diferente por instância quando tiver várias instâncias",
        "nl": "Geef cachedo aan om anders te zijn als je meerdere instanties hebt",
        "fr": "Ajuster le fichier cache pour être différent par instance lorsqu'il existe plusieurs instances",
        "it": "Regolare il file della cache per essere diverso per istanza quando hanno più istanze",
        "es": "Ajuste el archivo de caché para ser diferente por ejemplo al tener múltiples instancias",
        "pl": "Plik Adjust cache może być różny na przykład, gdy posiada wiele instancji",
        "zh-cn": "当发生多种情况时,独立的理由档案各不相同。"
      },
      "3.1.8": {
        "en": "Fix crash cases reported by Sentry",
        "de": "Reparieren Crashfälle gemeldet von Sentry",
        "ru": "Исправление случаев аварии, описанных Sentry",
        "pt": "Corrigir casos de acidente relatados por Sentry",
        "nl": "Vertaling:",
        "fr": "Troubles de crash signalés par Sentry",
        "it": "Correzione dei casi di crash segnalati da Sentry",
        "es": "Casos de accidente fijo reportados por Sentry",
        "pl": "Sprawy katastrofy Fix podane przez Sentry’a",
        "zh-cn": "Sentry所报告的六例事故"
      },
      "3.1.7": {
        "en": "Allow to remove a configuration value for \"round\" in config again",
        "de": "Lassen Sie einen Konfigurationswert für Runde in config wieder entfernen",
        "ru": "Разрешить удалить конфигурационную ценность для раунда в config снова",
        "pt": "Permitir remover um valor de configuração para round em config novamente",
        "nl": "Sta toe om weer een configuratiewaarde te verwijderen voor ronde in het leger",
        "fr": "Permettre de supprimer une valeur de configuration pour round in config à nouveau",
        "it": "Permette di rimuovere un valore di configurazione per round in config di nuovo",
        "es": "Permitir eliminar de nuevo un valor de configuración para redondear en configuración",
        "pl": "Allow, aby usunąć wartość konfiguracyjna w zakręcie ponownie w konfigunie",
        "zh-cn": "允许再次取消一轮谈判的组合价值"
      },
      "3.1.6": {
        "en": "When not count is provided for aggregate \"none\" or \"onchange\" then the limit (default 2000) is used as count to define the number of data to return.",
        "de": "Wenn für die Aggregate keine oder Onchange keine Zählung vorgesehen ist, wird die Grenze (Standard 2000) als Zählung verwendet, um die Anzahl der Daten zu definieren, um zurückzukehren.",
        "ru": "Когда не считать предоставляется для агрегата ни один или онмен, то предел (по умолчанию 2000) используется как считать, чтобы определить количество данных для возврата.",
        "pt": "Quando não a contagem é fornecida para agregar nenhum ou onchange, então o limite (padrão 2000) é usado como contagem para definir o número de dados para retornar.",
        "nl": "Als de tel niet wordt toegewezen voor aggregate noch onchange, dan wordt de limiet 2000 gebruikt om het aantal data te definiëren om terug te keren.",
        "fr": "Lorsqu'il n'y a pas de comptage pour l'agrégat ou le changement, la limite (par défaut 2000) est utilisée pour définir le nombre de données à retourner.",
        "it": "Quando il conteggio non viene fornito per aggregato nessuno o cambio, il limite (default 2000) viene utilizzato come conteggio per definire il numero di dati da restituire.",
        "es": "Cuando no se cuenta se proporciona para agregado ninguno o cambio entonces el límite (por defecto 2000) se utiliza como cuenta para definir el número de datos para regresar.",
        "pl": "Jeśli nieliczanie jest dostarczane dla agregacji ani zmian, to limit (default 2000) jest używany jako określenie liczby danych do powrotu.",
        "zh-cn": "当没有计算总额时,或当时的汇率(2000年)用来确定返回的数据数量。."
      },
      "3.1.5": {
        "en": "Make sure debug log is active according to the settings",
        "de": "Stellen Sie sicher, dass das Debug-Log gemäß den Einstellungen aktiv ist",
        "ru": "Убедитесь, что журнал debug активен в соответствии с настройками",
        "pt": "Certifique-se de que o log de depuração está ativo de acordo com as configurações",
        "nl": "Zorg ervoor dat het logboek actief is volgens de instellingen",
        "fr": "Assurez-vous que le journal debug est actif selon les paramètres",
        "it": "Assicurarsi che il registro di debug sia attivo in base alle impostazioni",
        "es": "Asegúrese de que el registro de depuración está activo según la configuración",
        "pl": "Umożliwia to, że log debug jest aktywny zgodnie z ustawieniami",
        "zh-cn": "B. 根据环境,确保有色色逻辑积极。"
      },
      "3.1.4": {
        "en": "Performance optimizations for GetHistory calls, especially for \"minmax\" aggregate method\nPrevent crash case reported by Sentry",
        "de": "Leistungsoptimierungen für GetHistory-Anrufe, insbesondere für minmax-Aggregatmethode\nVerhindern Crashfall berichtet von Sentry",
        "ru": "Оптимизация производительности для звонков GetHistory, особенно для метода minmax агрегата\nПредотвратить случай аварии, сообщается в Sentry",
        "pt": "Otimizações de desempenho para chamadas GetHistory, especialmente para método agregado minmax\nImpedir caso de acidente relatado por Sentry",
        "nl": "Performance optimisatie voor GetHistory calls, vooral voor minmax aggregate methode\nVertaling:",
        "fr": "Optimisations de performance pour les appels GetHistory, en particulier pour la méthode globale minmax\nPrévenir l ' accident signalé par Sentry",
        "it": "Ottimizzazione delle prestazioni per le chiamate GetHistory, in particolare per il metodo aggregato minmax\nPrevenire caso crash segnalato da Sentry",
        "es": "Optimizaciones de rendimiento para llamadas GetHistory, especialmente para minmax método agregado\nCaso de emergencia reportado por Sentry",
        "pl": "Optymalizacja wydajności dla wezwań GetHistory, zwłaszcza dla metody Minmax\nPrzygotowania do wypadku Sentry",
        "zh-cn": "GetHistory呼呼声的表现,特别是总括法\nSentry所报告的预防事故"
      },
      "3.1.3": {
        "en": "Corrected issue when testing connection to InfluxDBv1 with weird passwords",
        "de": "Problem beim Testen der Verbindung zu InfluxDBv1 mit seltsamen Passwörtern behoben",
        "ru": "Исправлена ошибка при тестировании подключения к InfluxDBv1 со странными паролями.",
        "pt": "Corrigido o problema ao testar a conexão com o InfluxDBv1 com senhas estranhas",
        "nl": "Probleem opgelost bij het testen van de verbinding met InfluxDBv1 met rare wachtwoorden",
        "fr": "Correction d'un problème lors du test de connexion à InfluxDBv1 avec des mots de passe étranges",
        "it": "Risolto problema durante il test della connessione a InfluxDBv1 con password strane",
        "es": "Problema corregido al probar la conexión a InfluxDBv1 con contraseñas extrañas",
        "pl": "Naprawiono problem podczas testowania połączenia z InfluxDBv1 za pomocą dziwnych haseł",
        "zh-cn": "更正了使用奇怪密码测试与 InfluxDBv1 的连接时出现的问题"
      }
    },
    "mode": "daemon",
    "platform": "Javascript/Node.js",
    "loglevel": "info",
    "messagebox": true,
    "subscribe": "messagebox",
    "keywords": [
      "charts",
      "logging",
      "influxdb"
    ],
    "preserveSettings": "custom",
    "supportCustoms": true,
    "getHistory": true,
    "enabled": true,
    "compact": true,
    "dependencies": [
      {
        "js-controller": ">=3.3.0"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=5.1.28"
      }
    ],
    "supportStopInstance": 10000,
    "stopTimeout": 10000,
    "authors": [
      "Bluefox <dogafox@gmail.com>",
      "Apollon77 <ingo@fischer-ka.de>",
      "Excodibur"
    ],
    "license": "MIT",
    "readme": "https://github.com/ioBroker/ioBroker.influxdb/blob/master/README.md",
    "icon": "influxdb.png",
    "extIcon": "https://raw.githubusercontent.com/ioBroker/ioBroker.influxdb/master/admin/influxdb.png",
    "type": "storage",
    "docs": {
      "de": [
        "docs/de/influxdb.md"
      ]
    },
    "plugins": {
      "sentry": {
        "dsn": "https://29eecf4e8c954f2ea78110d47a9b122d@sentry.iobroker.net/54"
      }
    },
    "adminUI": {
      "config": "json",
      "custom": "json"
    },
    "connectionType": "local",
    "dataSource": "push",
    "tier": 1,
    "eraseOnUpload": true,
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<2.1.1",
            "newVersion>=2.1.1"
          ]
        },
        "title": {
          "en": "Password needs to re re-entered after upgrade and other changes",
          "de": "Das Passwort muss nach dem Upgrade erneut eingegeben werden",
          "ru": "Пароль необходимо повторно ввести после обновления",
          "pt": "A senha precisa ser reinserida após a atualização",
          "nl": "Wachtwoord moet opnieuw worden ingevoerd na upgrade",
          "fr": "Le mot de passe doit être ressaisi après la mise à niveau",
          "it": "La password deve essere reinserita dopo l'aggiornamento",
          "es": "La contraseña debe volver a ingresarse después de la actualización",
          "pl": "Hasło musi zostać ponownie wprowadzone po aktualizacji",
          "zh-cn": "升级后需要重新输入密码"
        },
        "text": {
          "en": "After upgrading to Version 2.1.1 or later you need to re-entr your passwort/token for the access to the InfluxDB in the instance configuration.",
          "de": "Nach dem Upgrade auf Version 2.1.1 oder höher müssen Sie Ihr Passwort/Token für den Zugriff auf die InfluxDB in der Instanzkonfiguration erneut eingeben.",
          "ru": "После обновления до версии 2.1.1 или более поздней вам необходимо повторно ввести свой пароль/токен для доступа к InfluxDB в конфигурации экземпляра.",
          "pt": "Após atualizar para a Versão 2.1.1 ou posterior, você precisa reinserir sua senha/token para acesso ao InfluxDB na configuração da instância.",
          "nl": "Na het upgraden naar versie 2.1.1 of hoger moet u uw wachtwoord/token opnieuw invoeren voor toegang tot de InfluxDB in de instantieconfiguratie.",
          "fr": "Après la mise à niveau vers la version 2.1.1 ou ultérieure, vous devez ressaisir votre mot de passe/token pour l'accès à InfluxDB dans la configuration de l'instance.",
          "it": "Dopo l'aggiornamento alla versione 2.1.1 o successiva è necessario reinserire la password/token per l'accesso a InfluxDB nella configurazione dell'istanza.",
          "es": "Después de actualizar a la versión 2.1.1 o posterior, debe volver a ingresar su contraseña/token para acceder a InfluxDB en la configuración de la instancia.",
          "pl": "Po aktualizacji do wersji 2.1.1 lub nowszej należy ponownie wprowadzić hasło/token, aby uzyskać dostęp do bazy danych InfluxDB w konfiguracji instancji.",
          "zh-cn": "升级到 2.1.1 或更高版本后，您需要重新输入密码/令牌才能在实例配置中访问 InfluxDB。"
        },
        "level": "warn",
        "buttons": [
          "agree",
          "cancel"
        ]
      },
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<3.0.0",
            "newVersion>=3.0.0"
          ]
        },
        "title": {
          "en": "Important notice!",
          "de": "Wichtiger Hinweis!",
          "ru": "Важное замечание!",
          "pt": "Notícia importante!",
          "nl": "Belangrijke mededeling!",
          "fr": "Avis important!",
          "it": "Avviso IMPORTANTE!",
          "es": "Noticia importante!",
          "pl": "Ważna uwaga!",
          "zh-cn": "重要通知!"
        },
        "text": {
          "en": "This new version introduces several changes how values are logged because we fixed several issues and added new features. Please especially check the defined \"debounce\" and \"block time\" settings in your datapoints if values are not logged as expected and make sure the settings make sense. For more details please refer to the changelog and Readme.",
          "de": "Diese neue Version führt mehrere Änderungen ein, wie Werte protokolliert werden, da wir mehrere Probleme behoben und neue Funktionen hinzugefügt haben. Bitte überprüfen Sie insbesondere die definierten „Entprellen“- und „Sperrzeit“-Einstellungen in Ihren Datenpunkten, wenn Werte nicht wie erwartet protokolliert werden, und stellen Sie sicher, dass die Einstellungen sinnvoll sind. Weitere Details finden Sie im Changelog und in der Readme.",
          "ru": "В этой новой версии внесено несколько изменений в регистрацию значений, поскольку мы исправили несколько проблем и добавили новые функции. Пожалуйста, особенно проверьте определенные настройки «debounce» и «block time» в ваших точках данных, если значения не регистрируются должным образом, и убедитесь, что настройки имеют смысл. Для получения более подробной информации, пожалуйста, обратитесь к журналу изменений и Readme.",
          "pt": "Esta nova versão apresenta várias alterações na forma como os valores são registrados, pois corrigimos vários problemas e adicionamos novos recursos. Verifique especialmente as configurações definidas de \"debounce\" e \"block time\" em seus pontos de dados se os valores não forem registrados conforme o esperado e verifique se as configurações fazem sentido. Para obter mais detalhes, consulte o log de alterações e o Leiame.",
          "nl": "Deze nieuwe versie introduceert verschillende wijzigingen in de manier waarop waarden worden geregistreerd, omdat we verschillende problemen hebben opgelost en nieuwe functies hebben toegevoegd. Controleer vooral de gedefinieerde \"debounce\" en \"block time\" instellingen in uw datapunten als de waarden niet zijn vastgelegd zoals verwacht en zorg ervoor dat de instellingen kloppen. Raadpleeg de changelog en Readme voor meer informatie.",
          "fr": "Cette nouvelle version introduit plusieurs changements dans la journalisation des valeurs car nous avons corrigé plusieurs problèmes et ajouté de nouvelles fonctionnalités. Veuillez vérifier en particulier les paramètres \"anti-rebond\" et \"temps de blocage\" définis dans vos points de données si les valeurs ne sont pas enregistrées comme prévu et assurez-vous que les paramètres ont un sens. Pour plus de détails, veuillez consulter le journal des modifications et le fichier Lisez-moi.",
          "it": "Questa nuova versione introduce diverse modifiche al modo in cui i valori vengono registrati perché abbiamo risolto diversi problemi e aggiunto nuove funzionalità. Controllare in particolare le impostazioni definite \"debounce\" e \"block time\" nei propri datapoint se i valori non sono registrati come previsto e assicurarsi che le impostazioni abbiano un senso. Per maggiori dettagli, fare riferimento al log delle modifiche e al Leggimi.",
          "es": "Esta nueva versión introduce varios cambios en la forma en que se registran los valores porque solucionamos varios problemas y agregamos nuevas funciones. Verifique especialmente la configuración definida de \"antirrebote\" y \"tiempo de bloqueo\" en sus puntos de datos si los valores no se registran como se esperaba y asegúrese de que la configuración tenga sentido. Para obtener más detalles, consulte el registro de cambios y el archivo Léame.",
          "pl": "Ta nowa wersja wprowadza kilka zmian w sposobie rejestrowania wartości, ponieważ naprawiliśmy kilka problemów i dodaliśmy nowe funkcje. W szczególności sprawdź zdefiniowane ustawienia „odbicia” i „czasu blokowania” w punktach danych, jeśli wartości nie są rejestrowane zgodnie z oczekiwaniami i upewnij się, że ustawienia mają sens. Aby uzyskać więcej informacji, zapoznaj się z dziennikiem zmian i Readme.",
          "zh-cn": "这个新版本引入了一些更改值的记录方式，因为我们修复了几个问题并添加了新功能。如果未按预期记录值，请特别检查数据点中定义的“去抖动”和“阻塞时间”设置，并确保设置有意义。有关更多详细信息，请参阅更改日志和自述文件。"
        },
        "link": "https://github.com/ioBroker/ioBroker.influxdb/blob/master/README.md#default-settings",
        "level": "warn",
        "linkText": {
          "en": "Readme",
          "de": "Liesmich",
          "ru": "Прочти меня",
          "pt": "Leia-me",
          "nl": "Leesmij",
          "fr": "Lisez-moi",
          "it": "Leggimi",
          "es": "Léame",
          "pl": "Readme",
          "zh-cn": "自述文件"
        },
        "buttons": [
          "agree",
          "cancel"
        ]
      }
    ]
  },
  "native": {
    "debounce": 1000,
    "retention": 31536000,
    "dbname": "iobroker",
    "host": "localhost",
    "protocol": "http",
    "path": "",
    "port": 8086,
    "user": "",
    "password": "",
    "token": "",
    "organization": "",
    "round": 4,
    "seriesBufferMax": 0,
    "seriesBufferFlushInterval": 600,
    "changesRelogInterval": 0,
    "changesMinDelta": 0,
    "reconnectInterval": 10000,
    "pingInterval": 15000,
    "requestTimeout": 30000,
    "validateSSL": true,
    "dbversion": "1.x",
    "metaDataStorage": "fields",
    "pingserver": true,
    "blockTime": 0,
    "debounceTime": 0,
    "disableSkippedValueLogging": false,
    "enableLogging": false,
    "customRetentionDuration": 365,
    "relogLastValueOnStart": true
  },
  "protectedNative": [
    "password",
    "token"
  ],
  "encryptedNative": [
    "password",
    "token"
  ],
  "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    },
    {
      "_id": "info.connection",
      "type": "state",
      "common": {
        "role": "indicator.connected",
        "name": "If connected to InfluxDB",
        "type": "boolean",
        "read": true,
        "write": false,
        "def": false
      },
      "native": {}
    }
  ],
  "objects": []
}
